#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mazurerm_storage_account.functions: Refreshing state... [id=/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/crc-dev/providers/Microsoft.Storage/storageAccounts/crcfunctionsstorage][0m
[0m[1mazurerm_service_plan.functions: Refreshing state... [id=/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/crc-dev/providers/Microsoft.Web/serverfarms/crcsox-service-plan][0m
[0m[1mazurerm_cosmosdb_account.db: Refreshing state... [id=/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/crc-dev/providers/Microsoft.DocumentDB/databaseAccounts/crcsox-client-dev][0m
[0m[1mazurerm_static_site.site: Refreshing state... [id=/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/crc-dev/providers/Microsoft.Web/staticSites/CRC-Client-Dev][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # azurerm_windows_function_app.functions[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_windows_function_app" "functions" {
      [32m+[0m [0m[1m[0mbuiltin_logging_enabled[0m[0m           = true
      [32m+[0m [0m[1m[0mclient_certificate_enabled[0m[0m        = false
      [32m+[0m [0m[1m[0mclient_certificate_mode[0m[0m           = "Optional"
      [32m+[0m [0m[1m[0mcontent_share_force_disabled[0m[0m      = false
      [32m+[0m [0m[1m[0mcustom_domain_verification_id[0m[0m     = (sensitive value)
      [32m+[0m [0m[1m[0mdaily_memory_time_quota[0m[0m           = 0
      [32m+[0m [0m[1m[0mdefault_hostname[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0menabled[0m[0m                           = true
      [32m+[0m [0m[1m[0mfunctions_extension_version[0m[0m       = "~4"
      [32m+[0m [0m[1m[0mhttps_only[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mkey_vault_reference_identity_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                          = "centralus"
      [32m+[0m [0m[1m[0mname[0m[0m                              = "crcsox-functions"
      [32m+[0m [0m[1m[0moutbound_ip_address_list[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0moutbound_ip_addresses[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_address_list[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_addresses[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m               = "crc-dev"
      [32m+[0m [0m[1m[0mservice_plan_id[0m[0m                   = "/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/crc-dev/providers/Microsoft.Web/serverfarms/crcsox-service-plan"
      [32m+[0m [0m[1m[0msite_credential[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstorage_account_access_key[0m[0m        = (sensitive value)
      [32m+[0m [0m[1m[0mstorage_account_name[0m[0m              = "crcfunctionsstorage"
      [32m+[0m [0m[1m[0mstorage_uses_managed_identity[0m[0m     = false

      [32m+[0m [0mauth_settings {
          [32m+[0m [0m[1m[0madditional_login_parameters[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mallowed_external_redirect_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdefault_provider[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0missuer[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mruntime_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mtoken_refresh_extension_hours[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtoken_store_enabled[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0munauthenticated_client_action[0m[0m  = (known after apply)

          [32m+[0m [0mactive_directory {
              [32m+[0m [0m[1m[0mallowed_audiences[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
            }

          [32m+[0m [0mfacebook {
              [32m+[0m [0m[1m[0mapp_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mapp_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mapp_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m            = (known after apply)
            }

          [32m+[0m [0mgithub {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mgoogle {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mmicrosoft {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mtwitter {
              [32m+[0m [0m[1m[0mconsumer_key[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mconsumer_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mconsumer_secret_setting_name[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0msite_config {
          [32m+[0m [0m[1m[0malways_on[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mapp_scale_limit[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mdefault_documents[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mdetailed_error_logging_enabled[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0melastic_instance_minimum[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mftps_state[0m[0m                        = "Disabled"
          [32m+[0m [0m[1m[0mhealth_check_eviction_time_in_min[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhttp2_enabled[0m[0m                     = false
          [32m+[0m [0m[1m[0mip_restriction[0m[0m                    = (known after apply)
          [32m+[0m [0m[1m[0mload_balancing_mode[0m[0m               = "LeastRequests"
          [32m+[0m [0m[1m[0mmanaged_pipeline_mode[0m[0m             = "Integrated"
          [32m+[0m [0m[1m[0mminimum_tls_version[0m[0m               = "1.2"
          [32m+[0m [0m[1m[0mpre_warmed_instance_count[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mremote_debugging_enabled[0m[0m          = false
          [32m+[0m [0m[1m[0mremote_debugging_version[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mscm_ip_restriction[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mscm_minimum_tls_version[0m[0m           = "1.2"
          [32m+[0m [0m[1m[0mscm_type[0m[0m                          = (known after apply)
          [32m+[0m [0m[1m[0mscm_use_main_ip_restriction[0m[0m       = false
          [32m+[0m [0m[1m[0muse_32_bit_worker[0m[0m                 = true
          [32m+[0m [0m[1m[0mvnet_route_all_enabled[0m[0m            = false
          [32m+[0m [0m[1m[0mwebsockets_enabled[0m[0m                = false
          [32m+[0m [0m[1m[0mwindows_fx_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mworker_count[0m[0m                      = (known after apply)
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @charliedalldorf, Action: `pull_request`*